# -*- coding: utf-8 -*-

b={'停机坪': 0, '停车场': 1, '公园': 2, '公路': 3, '冰岛': 4, '商业区': 5, '墓地': 6, '太阳能发电厂': 7, '居民区': 8, '山地': 9, '岛屿': 10, '工厂': 11, '教堂': 12, '旱地': 13, '机场跑道': 14, '林地': 15, '桥梁': 16, '梯田': 17, '棒球场': 18, '水田': 19, '沙漠': 20, '河流': 21, '油田': 22, '油罐区': 23, '海滩': 24, '温室': 25, '港口': 26, '游泳池': 27, '湖泊': 28, '火车站': 29, '直升机场': 30, '石质地': 31, '矿区': 32, '稀疏灌木地': 33, '立交桥': 34, '篮球场': 35, '网球场': 36, '草地': 37, '裸地': 38, '足球场': 39, '路边停车区': 40, '转盘': 41, '铁路': 42, '风力发电站': 43, '高尔夫球场': 44}
a={'旱地': 1, '水田': 2, '梯田': 3, '草地': 4, '林地': 5, '商业区': 6, '油田': 7, '油罐区': 8, '工厂': 9, '矿区': 10, '太阳能发电厂': 11, '风力发电站': 12, '公园': 13, '游泳池': 14, '教堂': 15, '墓地': 16, '棒球场': 17, '篮球场': 18, '高尔夫球场': 19, '足球场': 20, '温室': 21, '网球场': 22, '居民区': 23, '岛屿': 24, '河流': 25, '停机坪': 26, '直升机场': 27, '机场跑道': 28, '桥梁': 29, '停车场': 30, '公路': 31, '路边停车区': 32, '转盘': 33, '立交桥': 34, '港口': 35, '铁路': 36, '火车站': 37, '裸地': 38, '沙漠': 39, '冰岛': 40, '山地': 41, '石质地': 42, '稀疏灌木地': 43, '海滩': 44, '湖泊': 45}
c={}
for i,k in b.items():
    c[k]=i
#print(c)
for i in c:
    for k in a:
        if c[i] == k:
            c[i] = a[k]
            break
print(c)
x=0
print(c[x])		
